Repository: salahalshafey/services_app
Catalog: lib/l10n/app_*.arb
Languages: ar

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Spanish
ar: الأسبانية

source: Frensh
ar: الفرنسية

source: German
ar: الألمانية

source: Turkish
ar: التركية

source: Ok
ar: حسناً

source: Back
ar: رجوع

source: Open navigation menu
ar: فتح قائمة التنقل

source: Error
ar: خطأ

source: Please Choose
ar: الرجاء تحديد خيار

source: Camera
ar: الكاميرا

source: Gallery
ar: الاستوديو

source: Share
ar: شارك

# errorHappenedWhileTryingToShareTheImage
source: An error happened while trying to share the image.
ar: حدث خطأ أثناء محاولة مشاركة الصورة.

source: Save to gallery
ar: حفظ في الاستوديو

source: Image saved to gallery
ar: تم حفظ الصورة في الاستوديو

# errorHappenedWhileSavingTheImage
source: An error happened while saving the image to the gallery.
ar: حدث خطأ أثناء حفظ الصورة في الاستوديو.

source: Attention
ar: انتباه

source: Do you want to exit?
ar: هل تريد الخروج؟

source: Exit
ar: الخروج

source: Cancel
ar: إلغاء

source: Copy code
ar: إنسخ الكود

source: Copid!
ar: تم النسخ!

source: km
ar: كيلومتر

source: meter
ar: متر

source: Link is Not valid
ar: الرابط غير صالح

source: You are currently offline
ar: أنت غير متصل بالانترنت

# linkDoesnotPointToImage
source: Link doesn't point to an image
ar: الرابط لا يشير إلى الصورة

# passwordMustBeAtLeastWithDetails
source: Password must be at least 8 characters long, with at least 5 alphabet, 2 numbers, and 1 special character like
ar: يجب أن تتكون كلمة المرور من 8 أحرف على الأقل، وأن تحتوي على 5 حروف ورقمين وحرف خاص واحد على الأقل مثل

# fiveAlphabetCharacters
source: 5 alphabet characters
ar: 5 حروف

# twoNumbers
source: 2 numbers
ar: رقمين

# oneSpecialCharachtersLike
source: 1 special charachters like
ar: حرف خاص مثل

source: Password must contain at least
ar: يجب أن تحتوي كلمة المرور على الأقل

source: And
ar: و

source: Today
ar: اليوم

source: Yesterday
ar: أمس

source: at
ar: الساعة

source: just now
ar: الآن

# durationAgo
source: {durationInString} ago
ar: منذ {durationInString}

# durationFromNow
source: {durationInString} from now
ar: بعد {durationInString} من الآن

source: second
ar: ثانية

# twoSeconds
source: 2 seconds
ar: ثانيتين

# secondsBeteenThreeAndTen
source: {numberOfSeconds} seconds
ar: {numberOfSeconds} ثواني

# secondsMoreThanTen
source: {numberOfSeconds} seconds
ar: {numberOfSeconds} ثانية

source: minute
ar: دقيقة

# twoMinutes
source: 2 minutes
ar: دقيقتين

# minutesBeteenThreeAndTen
source: {numberOfMinutes} minutes
ar: {numberOfMinutes} دقائق

# minutesMoreThanTen
source: {numberOfMinutes} minutes
ar: {numberOfMinutes} دقيقة

source: hour
ar: ساعة

# twoHours
source: 2 hours
ar: ساعتين

# hoursBeteenThreeAndTen
source: {numberOfHours} hours
ar: {numberOfHours} ساعات

# hoursMoreThanTen
source: {numberOfHours} hours
ar: {numberOfHours} ساعة

source: day
ar: يوم

# twoDays
source: 2 days
ar: يومين

# daysBeteenThreeAndTen
source: {numberOfDays} days
ar: {numberOfDays} أيام

# daysMoreThanTen
source: {numberOfDays} days
ar: {numberOfDays} يوم

source: week
ar: إسبوع

# twoWeeks
source: 2 weeks
ar: إسبوعين

# weeksBeteenThreeAndTen
source: {numberOfWeeks} weeks
ar: {numberOfWeeks} أسابيع

# weeksMoreThanTen
source: {numberOfWeeks} weeks
ar: {numberOfWeeks} إسبوع

source: month
ar: شهر

# twoMonths
source: 2 months
ar: شهرين

# monthsBeteenThreeAndTen
source: {numberOfMonths} months
ar: {numberOfMonths} أشهر

# monthsMoreThanTen
source: {numberOfMonths} months
ar: {numberOfMonths} شهر

source: year
ar: سنة

# twoYears
source: 2 years
ar: سنتين

# yearsBeteenThreeAndTen
source: {numberOfYears} years
ar: {numberOfYears} سنوات

# yearsMoreThanTen
source: {numberOfYears} years
ar: {numberOfYears} سنة

source: decade
ar: عقد

# twoDecades
source: 2 decades
ar: عقدين

# decadesBeteenThreeAndTen
source: {numberOfDecades} decades
ar: {numberOfDecades} عقود

# decadesMoreThanTen
source: {numberOfDecades} decades
ar: {numberOfDecades} عقد

source: Something went wrong, please try again later.
ar: حدث خطأ ما ، الرجاء المحاولة في قت لاحق

# errorHappendThereIsNoDataForThatAccount
source: Error happened, There is no data for that Account
ar: حدث خطأ، لا توجد بيانات لهذا الحساب

# unexpectedErrorHappened
source: An unexpected error happened.
ar: حدث خطأ غير متوقع.

source: Something went wrong!!
ar: حدث خطأ ما!!

source: Not able to save files to local device storage.
ar: غير قادر على حفظ الملفات على مساحة تخزين الجهاز المحلي.

source: Not able to delete files from local device storage.
ar: غير قادر على حذف الملفات من مساحة تخزين الجهاز المحلي.

source: Not Able To read data from Local Device
ar: غير قادر على قرائة البيانات من داخل الجهاز

# sorryThereIsNoResultForYourSearch
source: Sorry, there is no result for your search, the result has been filtered.
ar: عذرًا، لا توجد نتائج لبحثك، تم تصفية النتيجة.

# sorryThereIsNoResultForYourSearchWithDetails
source: **Sorry, there is no result for your search** * The result has been filtered. * Or you are searching with a **language** that is not supported yet.
ar: **عذرًا، لا توجد نتائج لبحثك** * تمت تصفية النتيجة. * أو أنك تبحث باستخدام **لغة** غير مدعومة حالياً.

source: Not Able To Save data To Local Device
ar: غير قادر على حفظ البيانات داخل الجهاز المحلي

source: Home
ar: الرئيسية

source: Profile
ar: الحساب الشخصي

source: Meals Settings
ar: إعدادات الوجبات

source: General Settings
ar: الإعدادات العامة

# shareTheApp
source: Share
ar: شارك التطبيق

# shareTheAppText
source: AI MealMingle App Download from the Play Store https://play.google.com/store/apps/details?id=com.salahalshafey.aimealmingle
ar: تطبيق AI MealMingle لتحميل التطبيق من جوجل بلاي https://play.google.com/store/apps/details?id=com.salahalshafey.aimealmingle

source: About
ar: عن التطبيق

source: Log out
ar: تسجيل الخروج

source: Sign In
ar: تسجيل الدخول

source: Adjust your Meals Selection
ar: تعديل اختيارات وجباتك

source: Gluten-Free
ar: خالي من الجلوتين

source: Lactose-Free
ar: خالي من اللاكتوز

source: Vegetarian
ar: نباتي

source: Vegan
ar: نباتي صارم (فيجان)

source: Display {mealType} Meals
ar: عرض وجبات {mealType}

source: Display Arabic Language
ar: عرض اللغة العربية

source: Display Dark Theme
ar: عرض الوضع المظلم

source: Color
ar: اللون

source: Reset to default
ar: إعادة إلى الوضع الافتراضي

source: Settings
ar: الإعدادات

source: Theme
ar: السمات

source: Theme Mode
ar: السمات

source: System default
ar: تلقائياً مع النظام

source: Light
ar: فاتح

source: Dark
ar: مظلم

source: Language
ar: اللغة

source: Notifications
ar: الإشعارات

source: Change Language
ar: تغيير اللغة

source: Change to Light Mode
ar: التغيير إلى الوضع الفاتح

source: Change to Dark Mode
ar: التغيير إلى الوضع المظلم

# defaultWord
source: default
ar: تلقائياً

source: All Languages
ar: كل اللغات

# actAsANutritionistWithYearsOfExperienceInTheField
source: Act as a nutritionist with 30 years of experience in the field. What is in this image? And how many calories are in it?
ar: تصرف كخبير تغذية بخبرة 30 عامًا في هذا المجال.ماذا يوجد في هذه الصورة؟ وكم عدد السعرات الحرارية فيه؟

# isThisFoodConsideredHealthyExplainTheBenefits
source: Is this food considered Healthy? Explain The benefits of this food in detail and Why? If there is more than one item, "Give the result in table format for each item".
ar: هل يعتبر هذا الطعام صحي؟ اشرح فوائد هذا الطعام بالتفصيل ولماذا؟ إذا كان هناك أكثر من عنصر واحد، "أعط النتيجة في جدول لكل عنصر".

# pleaseGiveMeTheFollowingNutritionFacts
source: Please give me the following Nutrition Facts: - Calories. - Proteins (g). - Fats (g). - What Vitamins are in it? - Carbohydrates (g). - Sodium (mg). - Potassium (mg). - and more... If there is more than one item, "Give the result in table format for each item and the overall (sum) of the results of all the above".
ar: من فضلك أعطني الحقائق الغذائية التالية: - سعرات حرارية. - البروتينات (ز). - الدهون (ز). - ما هي الفيتامينات الموجودة فيه؟ - الكربوهيدرات (جم). - الصوديوم (ملغ). - البوتاسيوم (ملغ). - و اكثر... إذا كان هناك أكثر من عنصر، "أعط النتيجة في جدول لكل عنصر وإجمالي (مجموع) نتائج كل ما سبق".

# pleaseAnswerTheFollowingnDoesThisFoodContain
source: Please answer the following: - Does this food contain "Pork or Alcohol"? - Does this food contain "Gluten"? - Does this food contain Lactose? - Is this food considered "Vegetarian"? - Is this food considered "Vegan"? - and more... If there is more than one item, "Give the result in table format for each item and the overall (sum) of the results of all the above".
ar: الرجاء الإجابة على ما يلي: - هل يحتوي هذا الطعام على "لحم الخنزير أو الكحول"؟ - هل يحتوي هذا الطعام على "الجلوتين"؟ - هل يحتوي هذا الطعام على "اللاكتوز"؟ - هل يعتبر هذا الطعام "نباتي"؟ - هل يعتبر هذا الطعام "فيجان"؟ - و اكثر... إذا كان هناك أكثر من عنصر، "أعط النتيجة في جدول لكل عنصر وإجمالي (مجموع) نتائج كل ما سبق".

# howToPrepareThisFoodnnifThereIsMoreThanOneItemGiveTheResultForEachItem
source: How to prepare this food? If there is more than one item, "Give the result for each item".
ar: طريقة تحضير هذا الطعام؟ "المكونات والخطوات" إذا كان هناك أكثر من عنصر واحد، "أعط النتيجة لكل عنصر".

source: Scan Food With AI
ar: مسح الطعام باستخدام الذكاء الاصطناعي

source: Scan Food
ar: مسح الطعام

source: Favorites
ar: المفضلة

source: Get Image to Scan
ar: الحصول على صورة طعام للمسح

source: You Have no Favorites yet - Start Adding Some!
ar: ليس لديك مفضلات بعد - ابدأ بإضافة بعض!

source: Unveiling Contents and Caloric Breakdown
ar: كشف المحتويات وتفكيك السعرات الحرارية

source: Healthiness and Benefits of Featured Foods
ar: الصحة والفوائد من الأطعمة المميزة

source: Facts and Summaries
ar: الحقائق والملخصات

source: Unveiling Dietary Preferences and Status
ar: كشف تفضيلاتك الغذائية والحالة الصحية

source: How to Prepare it at Home
ar: كيفية إعداده في المنزل

source: Overview
ar: نظرة عامة

source: Nutritional Evaluation
ar: تقييم تغذوي

source: Comprehensive Nutrition Analysis
ar: تحليل التغذية الشامل

source: Ingredient Inquiry
ar: استفسار عن المكونات

source: How To Prepare It
ar: كيفية إعداده

source: Confirm Remove?
ar: تأكيد الإزالة؟

source: Are you sure you want to remove this Scan result from Favorites?
ar: هل أنت متأكد أنك تريد إزالة نتيجة هذا المسح من المفضلات؟

source: Remove
ar: إزالة

source: Remove from favorites
ar: إزالة من المفضلات

source: Save to favorites
ar: حفظ في المفضلات

source: Share as PDF
ar: مشاركة كملف PDF

source: Taking screenshots of the results...
ar: أخذ لقطات شاشة للنتائج...

source: Converting screenshots to PDF...
ar: تحويل لقطات الشاشة إلى PDF...

source: Preparing the PDF to be saved at Desktop...
ar: تحضير ملف PDF للحفظ على سطح المكتب...

source: Preparing the PDF to Share...
ar: تحضير ملف PDF للمشاركة...

source: Error happened, Couldn't share the PDF!!!
ar: حدث خطأ، لم يتمكن من مشاركة ملف PDF!!!

source: Search
ar: بحث

source: Search Meals Using AI
ar: بحث عن وجبات باستخدام الذكاء الإصطناعي

source: Clear
ar: إزالة

source: Meals
ar: وجبات

source: INGREDIENTS
ar: المكونات والمقادير

source: RECIPE
ar: طريقة التحضير

# hi
source: Hi {name} ðŸ‘‹
ar: مرحبًا {name} 👋

source: WHAT DO YOU WANT TO EAT ?
ar: ما الذي ترغب في تناوله؟

source: CATEGORIES
ar: الفئات

source: Are you sure you want to remove this Meal from Favorites?
ar: هل أنت متأكد أنك تريد إزالة هذا الوجبة من المفضلات؟

source: App Overview
ar: نظرة عامة

# appOverviewdetailed
source: **Breast Cancer Awareness app** is a comprehensive tool designed to raise awareness and promote early detection of breast cancer. It addresses four key aspects: providing `information and awareness`, facilitating `self-examination` through a symptom checker, assisting doctors with `deep learning models` for detection, and offering support `resources` and `guidance` for patients. * **Purpose:** The app was created with the primary goal of empowering individuals to take charge of their breast health. By amalgamating information, self-examination tools, advanced detection models, and supportive resources, we aim to contribute to the early detection and management of breast cancer. * **Target Audience:** Our target audience spans a wide range, including individuals of all genders interested in breast health awareness, those performing self-examinations, medical professionals seeking advanced diagnostic tools, and patients in need of support and guidance. **Key Features** * **Information Hub:** Accessible information on breast cancer, its symptoms, risk factors, and preventive measures. * **Symptom Checker:** An interactive self-examination tool guiding users through the detection of potential symptoms. * **Deep Learning Models:** Advanced AI models for doctors, aiding in the detection of breast cancer from mammogram and histopathology images. * **Patient Support:** Nutrition, diet, and exercise guidance, along with a chatbot providing answers and guidance through text-to-speech and speech-to-text capabilities. **Data and Research** * **The Breast Cancer Awareness app** is built on a foundation of thorough research and collaboration with medical professionals. We've incorporated insights from reputable studies and partnered with experts in the field to develop the deep learning models. The app's content is curated based on evidence-based information to ensure accuracy and reliability. **Contact and App Privacy**
ar: **تطبيق التوعية بسرطان الثدي** هو أداة شاملة مصممة لزيادة الوعي وتعزيز الكشف المبكر عن سرطان الثدي. ويتناول أربعة جوانب رئيسية: توفير `المعلومات والتوعية`، وتسهيل `الفحص الذاتي` من خلال أداة فحص الأعراض، ومساعدة الأطباء من خلال `نماذج التعلم العميق` للكشف، وتقديم `مصادر` الدعم و`التوجيه` للمرضى. * **الغرض:** تم إنشاء التطبيق بهدف أساسي هو تمكين الأفراد من تولي مسؤولية صحة الثدي. من خلال دمج المعلومات وأدوات الفحص الذاتي ونماذج الكشف المتقدمة والمصادر الداعمة، نهدف إلى المساهمة في الكشف المبكر عن سرطان الثدي وإدارته. * **الجمهور المستهدف:** يمتد جمهورنا المستهدف على نطاق واسع، بما في ذلك الأفراد من جميع الأجناس المهتمين بالتوعية بصحة الثدي، والذين يقومون بالفحوصات الذاتية، والأطباء الأخصائيين الذين يبحثون عن أدوات تشخيصية متقدمة، والمرضى الذين يحتاجون إلى الدعم والتوجيه. **الميزات الرئيسية** * **مركز المعلومات: ** معلومات يمكن الوصول إليها عن سرطان الثدي وأعراضه وعوامل الخطر والتدابير الوقائية. * **مدقق الأعراض:** أداة فحص ذاتي تفاعلية توجه المستخدمين خلال عملية اكتشاف الأعراض المحتملة. * **نماذج التعلم العميق:** نماذج ذكاء اصطناعي متقدمة للأطباء، تساعد في الكشف عن سرطان الثدي من خلال صور الأشعة السينية للثدي والنسيجي (هيستوباثولوجي). * **دعم المرضى:** توجيه التغذية والنظام الغذائي وممارسة التمارين الرياضية ، بالإضافة إلى برنامج chatbot الذي يوفر الإجابات والإرشادات من خلال إمكانيات تحويل النص إلى كلام وتحويل الكلام إلى نص. **البيانات والأبحاث** * **تطبيق التوعية بسرطان الثدي ** مبني على أساس البحث والتعاون مع الأطباء والأخصائيين. لقد قمنا بدمج رؤى من الدراسات العلمية واستشارة خبراء في هذا المجال لتطوير نماذج التعلم العميق. يتم تنظيم محتوى التطبيق بناءً على معلومات قائمة وموثوقة لضمان الدقة والإعتمادية. **الخصوصية و معلومات الإتصال**

# contactUs
source: Contact us through this email:
ar: تواصل معنا عبر هذا البريد الإلكتروني

source: Privacy Policy
ar: سياسة الخصوصية

source: Terms Of Service
ar: شروط الإستخدام
